net.vandut.agh.magisterka/logic-wsdl-first/src/main/resources/LogicService.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://service.logic.magisterka.agh.vandut.net/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" name="wsdl-first" targetNamespace="http://service.logic.magisterka.agh.vandut.net/">
	<wsdl:types>
		<xsd:schema targetNamespace="http://service.logic.magisterka.agh.vandut.net/" elementFormDefault="qualified">
			<xsd:element name="GetLogic">
				<xsd:complexType />
			</xsd:element>
			<xsd:element name="GetLogicResponse">
				<xsd:complexType>
					<xsd:sequence>
						<xsd:element minOccurs="0" maxOccurs="1" name="GetLogicResult" type="xsd:string"/>
					</xsd:sequence>
				</xsd:complexType>
			</xsd:element>
		</xsd:schema>
	</wsdl:types>
	<wsdl:message name="GetLogicRequest">
		<wsdl:part name="payload" element="tns:GetLogic"/>
	</wsdl:message>
	<wsdl:message name="GetLogicResponse">
		<wsdl:part name="payload" element="tns:GetLogicResponse"/>
	</wsdl:message>
	<wsdl:portType name="Logic">
		<wsdl:operation name="GetLogic">
			<wsdl:input message="tns:GetLogicRequest"/>
			<wsdl:output message="tns:GetLogicResponse"/>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="LogicSOAPBinding" type="tns:Logic">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="GetLogic">
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="LogicService">
		<wsdl:port name="soap" binding="tns:LogicSOAPBinding">
			<soap:address location="http://0.0.0.0:9090/LogicService/"/>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>
