net.vandut.agh.magisterka/java-client/src/main/resources/org/apache/servicemix/samples/wsdl_first/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
              xmlns:tns="http://service.logic.magisterka.agh.vandut.net/">
  <env:Body>
    <tns:GetLogic>
      <tns:personId>world</tns:personId>
    </tns:GetLogic>
  </env:Body>
</env:Envelope>
